package Lab_3;

public class Example_7 {
    public static void main(String[] args) {
        String alphabet = "абвгдеёжзийклмнопрстуфхцчшщъыьэюя";
        System.out.println("Дана строка: "+alphabet);
        System.out.println("Необходимо вывести массив из 10 элементов, в массив пападет каждая 2ая буква.");
        System.out.println("Так же необходимо вывести обратный массив.");

        String[] a

        for (i in)
    }

}


//        Напишите программу, в которой создается одномерный
//        символьный массив из 10 элементов. Массив заполняется буквами «через
//        одну», начиная с буквы ' а ': то есть массив заполняется буквами ' а ' , ' с ' , ' е ' ,
//        ' д ' и так далее. Отобразите массив в консольном окне в прямом и обратном
//        порядке. Размер массива задается переменной